In [66]:
import os
import pandas as pd

In [67]:
# 1. Create DataFrame
# hr-info.csv => euc-kr encoding
# index == "EID"
os.getcwd()
data = pd.read_csv("./data/병합예제3/hr-info.csv", index_col="EID",encoding="euc-kr")
data

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.00,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.00,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.00,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.00,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N

In [68]:
# dataFrame 정보확인하기 .info()
data.info()
# 여기에서 결측치가 있는지 확인할 수 있다.

<class 'pandas.core.frame.DataFrame'>
Index: 200 entries, E00206 to E00428
Data columns (total 19 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ENAME               200 non-null    object
 1   GENDER              200 non-null    object
 2   ORG_CD              197 non-null    object
 3   POS_CD              200 non-null    object
 4   AGE                 200 non-null    int64
 5   SERVICE_YEAR        200 non-null    int64
 6   EDU_LEVEL           200 non-null    object
 7   PERFORMANCE_SCORE   200 non-null    float64
 8   SALARY              200 non-null    int64
 9   LAST_PROMO_DT       182 non-null    object
 10  TRAINING_HOURS      200 non-null    int64
 11  SKILLS              200 non-null    object
 12  ACTIVE_STATE        200 non-null    object
 13  HIRE_DATE           200 non-null    object
 14  RETIRE_DATE         49 non-null     object
 15  RETIRE_REASON       49 non-null     object
 16  REHIRE_YN           49 non-null     object
 17  NATION              200 non-null    object
 18  ROUNDING_DEDUCTION  200 non-null    object
dtypes: float64(1), int64(4), object(14)
memory usage: 31.2+ KB

In [69]:
# data.head(10)
data.head(10)
data.tail(10)

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00364,사디길,M,ORG027,P009,22,0,고등학교 졸업,0.0,4500,NaN,4,Java,Y,2024-03-01,NaN,NaN,NaN,KOREA,N
E00382,망팽단,F,ORG026,P009,22,0,학사 학위,0.0,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00189,초옥덕,F,ORG020,P009,23,0,학사 학위,0.0,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00248,말만양,M,ORG017,P009,23,0,학사 학위,0.0,4500,NaN,4,"Project Management, Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00250,비식백,M,ORG019,P009,23,0,학사 학위,0.0,4500,NaN,4,"Project Management, Python",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.0,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.0,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.0,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.0,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.0,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N

In [70]:
# 행/열 크기확인 => 속성 shape 로 확인 => 괄호가 없다. 
data.shape

(200, 19)

In [71]:
# 상위 10개의 데이터만 보고싶다. => head() function 사용
data.head(10)

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
E00242,규모사,M,ORG027,P004,47,18,학사 학위,2.22,8300,2024-03-01,0,"Java, Salesforce, Python",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00298,포난서,F,ORG021,P004,47,19,석사 학위,3.63,8500,2023-03-01,47,Data Analysis,Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
E00487,고명초,F,ORG014,P004,47,20,석사 학위,1.81,8600,2022-03-01,49,"Marketing, Salesforce, Project Management",Y,2004-03-01,NaN,NaN,NaN,Japan,Y
E00169,제언로,M,ORG004,P004,48,20,학사 학위,3.90,8500,2022-03-01,32,"Salesforce, Data Analysis, Python",Y,2004-03-01,NaN,NaN,NaN,KOREA,Y
E00218,영할휘,M,ORG003,P004,48,20,학사 학위,3.22,8500,2022-03-01,86,"Data Analysis, Salesforce",Y,2004-03-01,NaN,NaN,NaN,KOREA,Y

In [72]:
# 하위 10개의 데이터만 보고싶다. => tail() function 사용
data.tail(10)

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00364,사디길,M,ORG027,P009,22,0,고등학교 졸업,0.0,4500,NaN,4,Java,Y,2024-03-01,NaN,NaN,NaN,KOREA,N
E00382,망팽단,F,ORG026,P009,22,0,학사 학위,0.0,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00189,초옥덕,F,ORG020,P009,23,0,학사 학위,0.0,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00248,말만양,M,ORG017,P009,23,0,학사 학위,0.0,4500,NaN,4,"Project Management, Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00250,비식백,M,ORG019,P009,23,0,학사 학위,0.0,4500,NaN,4,"Project Management, Python",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.0,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.0,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.0,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.0,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.0,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N

In [73]:
# 2. Read(indexing, slicing, selecting)

In [74]:
# 열 이름만 가져오기 => 속성 data.columns 사용하기
data.columns

Index(['ENAME', 'GENDER', 'ORG_CD', 'POS_CD', 'AGE', 'SERVICE_YEAR',
       'EDU_LEVEL', 'PERFORMANCE_SCORE', 'SALARY', 'LAST_PROMO_DT',
       'TRAINING_HOURS', 'SKILLS', 'ACTIVE_STATE', 'HIRE_DATE', 'RETIRE_DATE',
       'RETIRE_REASON', 'REHIRE_YN', 'NATION', 'ROUNDING_DEDUCTION'],
      dtype='object')

In [75]:
# 열 하나를 지정해서 values 가져오기. => Series 형식으로 가져오기
data["ENAME"] # 하나의 시리즈로 가져온것이다. 
# dataFrame 형식으로 가져오고싶다면  => DataFrame 형식으로 가져오고싶다면
data[["ENAME"]] # 이렇게 가져오면 된다.



# data.iloc[0] 이건 행을 인덱싱하는것이다. 다른것이다.

       ENAME
EID
E00206   시이오
E00181   나사장
E00164  난부사장
E00190   판라다
E00209   누훈봉
...      ...
E00322   부탐회
E00389   초두반
E00438   권개득
E00304   탐출조
E00428   을충나

[200 rows x 1 columns]

In [76]:
# 열을 여러개 가져오기 => ENAME, GENDER, AGE => 시리즈가 여러게 포함된거라서 데이터프레임 형식으로 
data[["ENAME","GENDER","AGE"]]

       ENAME GENDER  AGE
EID
E00206   시이오      M   49
E00181   나사장      F   49
E00164  난부사장      M   48
E00190   판라다      F   47
E00209   누훈봉      M   47
...      ...    ...  ...
E00322   부탐회      F   23
E00389   초두반      F   23
E00438   권개득      M   23
E00304   탐출조      M   24
E00428   을충나      F   24

[200 rows x 3 columns]

In [77]:
# 슬라이싱 해보기 row 5개의 모든 column의 values 가져오기  => 행 슬라이싱 
data[0:5:1]  # default 값들은 알지?

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
EID,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y

In [78]:
# 슬라이싱 table 형식으로 가져오기 row 5개 ,column age까지 => table 형식으로 가져오려면 indexer 사용해야한다. 
# 이부분 내가 잘 모르네~~~~

data.iloc[0:5, 0:5]

       ENAME GENDER  ORG_CD POS_CD  AGE
EID
E00206   시이오      M     NaN   P001   49
E00181   나사장      F     NaN   P002   49
E00164  난부사장      M     NaN   P003   48
E00190   판라다      F  ORG007   P004   47
E00209   누훈봉      M  ORG023   P004   47

In [79]:
# dataframe 연산하기 
# salary column을 월급으로 표현해보자.
data["SALARY"] # 연봉으로 되어있다.

# 반올림 => round(소수점 자리수)
data_month = (data["SALARY"]/12).round(1)  
data_month

EID
E00206    850.0
E00181    791.7
E00164    758.3
E00190    708.3
E00209    716.7
          ...
E00322    375.0
E00389    375.0
E00438    375.0
E00304    375.0
E00428    375.0
Name: SALARY, Length: 200, dtype: float64

In [80]:
# Monthly pay => 월급 컬럼 추가하기
data["MONTHLY_PAY"] = data_month
data

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION,MONTHLY_PAY
EID,,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y,850.0
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y,791.7
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y,758.3
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y,708.3
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y,716.7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.00,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.0
E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.00,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.0
E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.00,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.0
E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.00,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.0
E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.0

In [81]:
upper_500 = data[data["MONTHLY_PAY"] >= 500]
upper_500

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION,MONTHLY_PAY
EID,,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y,850.0
E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y,791.7
E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y,758.3
E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y,708.3
E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y,716.7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00497,리상녹,M,ORG011,P006,38,8,고등학교 졸업,2.51,6800,2023-03-01,36,"Data Analysis, Marketing",Y,2016-03-01,NaN,NaN,NaN,Japan,Y,566.7
E00255,예정서,M,ORG021,P006,39,9,학사 학위,1.99,6900,2022-03-01,93,"Marketing, Data Analysis",Y,2015-03-01,NaN,NaN,NaN,KOREA,Y,575.0
E00307,도단강,M,ORG007,P006,39,7,학사 학위,4.28,6700,2024-03-01,32,Data Analysis,Y,2017-03-01,NaN,NaN,NaN,Japan,Y,558.3
E00379,권철희,F,ORG005,P006,39,8,석사 학위,1.55,6900,2023-03-01,61,"Python, Java, Data Analysis",N,2016-03-01,2021-02-28,개인 사유,N,India,Y,575.0
E00467,훼로훤,F,ORG004,P006,39,9,학사 학위,4.34,6900,2022-03-01,88,"Data Analysis, Java",Y,2015-03-01,NaN,NaN,NaN,Japan,Y,575.0

In [82]:
# 입사 당시 나이
data["AGE"] = data["AGE"].astype(int)  # 나이를 정수형으로 변환

In [92]:
# 문자열 연산  = > df.str[:]
# 학위에 따라 연봉의 평균을 구해보자! 
# EDU_LEVEL 컬럼에서 학위를 제거하기

data
# str은 table 형식으로만 슬라이싱이 되는거야? 
data.loc[ : , "EDU_LEVEL"]  # column을 하나만 지정하면 Series로 된다. 


data["EDU_LEVEL"].str.replace(" 학위", "")

# 변수에 저장하면서 update 하기
data["EDU_LEVEL"]= data["EDU_LEVEL"].str.replace(" 학위", "")
data

,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION,MONTHLY_PAY
EID,,,,,,,,,,,,,,,,,,,,
E00206,시이오,M,NaN,P001,49,25,박사,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y,850.0
E00181,나사장,F,NaN,P002,49,24,박사,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y,791.7
E00164,난부사장,M,NaN,P003,48,22,박사,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y,758.3
E00190,판라다,F,ORG007,P004,47,18,박사,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y,708.3
E00209,누훈봉,M,ORG023,P004,47,19,박사,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y,716.7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00322,부탐회,F,ORG014,P009,23,0,학사,0.00,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.0
E00389,초두반,F,ORG012,P009,23,0,학사,0.00,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.0
E00438,권개득,M,ORG024,P009,23,0,학사,0.00,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.0
E00304,탐출조,M,ORG009,P009,24,0,학사,0.00,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.0
E00428,을충나,F,ORG003,P009,24,0,학사,0.00,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N,375.0

In [ ]:
# groupby() 사용하기 => 그룹으로 묶어라 => aggregation  
# 이해도 0 이네 
data.groupby(by="EDU_LEVEL").agg({"SALARY": "mean"})

                SALARY
EDU_LEVEL
고등학교 졸업    6140.000000
박사         8166.666667
석사         6900.000000
전문대        5050.000000
학사         5727.044025